app/Models/UserModel.php

    public function selectUser() {
        return $this->db->
        table('users')->
        where('email', $_POST['email'])->
        get()->getRowArray();
---
SELECT *
FROM `users`